---
kind: type
id: T:Autodesk.Revit.DB.VirtualPrinterType
source: html/1dbef4a3-3f51-91ad-5a9e-04c36be1c5ca.htm
---
# Autodesk.Revit.DB.VirtualPrinterType

An enumerated to list Virtual Printer Types in Revit.

## Syntax (C#)
```csharp
public enum VirtualPrinterType
```